{
    "telemetry": "Telemetry",
    "history": "History",
    "accounting": "Accounting",
    "expenses": "Expenses",
    "income": "Income",
    "gallery": "Gallery",
    "about": "About",
    "users": "Users",
    "settings": "Settings",

    "language": "Language",
    "changeLanguage": "Change Language",
    "logout": "Logout",

    "selectDataField": "Select Data Field",
    "temp": "Temperature",
    "do": "Dissolved Oxygen",
    "doPerc": "Dissolved Oxygen Percentage",
    "phValue": "pH Value",
    "salinity": "Salinity",

    "search": "Search",

    "loggerID": "Logger ID",
    "date": "Date",
    "time": "Time",
    "tempDeg": "Temp (&deg;C)",
    "DO": "DO (mgL)",
    "do%": "DO (%)",
    "ec": "EC",
    "hex": "HEX",

    "expRec": "Expense Record",
    "expsRec": "Expenses Record",
    "addExpRec": "Add Expenses Record",
    "addNewExpRec": "Add New Expense Record",
    "expAnalysis": "Expense Analysis",
    "expCategoryAnalysis": "Expense Category Analysis",

    "amount": "Amount",
    "expItem": "Expense Item",
    "incomeItem": "Income Item",
    "category": "Category",
    "remarks": "Remarks",
    "uploadFiles": "Upload Files",
    "clickAddFiles": "Click to add files",
    "viewRec": "View Record",
    "clickImage": "Click Image to View",
    
    "submit": "Submit",
    "add":"Add",
    "genPDF": "Generate PDF",
    "print": "Print",
    "fileTypeUploadValidation": "File Type: .JPEG, .JPG, or .PNG only.",

    "incomeRec": "Income Record",
    "addIncomeRec": "Add Income Record",
    "addNewIncomeRec": "Add New Income Record",
    "incomeAnalysis": "Income Analysis",
    "incomeCategoryAnalysis": "Income Category Analysis",

    "userProfile": "User Profile",
    "userID": "User ID",
    "name": "Name",
    "role": "Role",
    "firstName": "First Name",
    "lastName": "Last Name",
    "e-mail": "E-mail",
    "edit": "Edit",
    "addUser": "Add New User",
    "generateLinkHeader": "Generate Registration Link ",
    "linkExp": "Link Expiry (days)",
    "admin": "Admin",
    "viewer": "Viewer",
    "generateButton": "Generate Link",

    "dwCSV": "Download CSV",
    "moreInfo": "More info",
    "realTime": "Real Time",

    "currentTemp": "Current Temperature",
    "tempExtremes": "Temperature Extremes",

    "currentDissOxy": "Current Dissolved Oxygen",
    "dissOxyExtremes": "Dissolved Oxygen Extremes",

    "currentDissOxyPerc": "Current Dissolved Oxygen Percentage",
    "dissOxyPercExtremes": "Dissolved Oxygen Percentage Extremes",

    "currentPH": "Current pH Value",
    "phExtremes": "pH Value Extremes",

    "currentSalinity": "Current Salinity",
    "salinityExtremes": "Salinity Extremes",

    "dateRangePlaceholder": "Select Date Range",
    "datetime": "Date & Time",
    "action": "Action",
    "view": "View",
    
    "weekly": "Weekly",
    "monthly": "Monthly",
    "yearly": "Yearly",

    "update": "Update",
    "ippb": "FISHERIES RESEARCH INSTITUTE, SARAWAK AND LABUAN,BINTAWA DIVISION (IPPB)",
    "background": "Background",
    "backgroundContent": "In 1965, the Federal Government of Malaysia established the Sarawak Marine Fisheries Department (JPLS) to develop and manage marine and brackish water fisheries in Sarawak. The research branch within JPLS was responsible for conducting strategic research to support fisheries management development in Sarawak. This research focused on fishery resources and capture technology in Sarawak. In 1980, this research expanded to the marine and brackish water aquaculture sector to enhance aquaculture development in potential areas in Sarawak. In 1995, the Research Branch's supervision shifted from JPLS to the Malaysian Fisheries Research Institute based in Penang, with its new name being the Institute of Fisheries Research, Sarawak and Labuan, Bintawa Division (IPPB).",
    "RMKe12": "Aquaculture Research Program under the Twelfth Malaysia Plan (RMKe12)",
    "RMKe12Content": "The Institute of Fisheries Research, Sarawak and Labuan Division, Bintawa, also known as IPPB, through funding from the Twelfth Malaysia Plan (RMKe12), is conducting the Research Program for the Development of New Methods in Enhancing the Survival and Health of Fish/Shrimp in Aquaculture in Sarawak (P21300060132005) from 2021 until 2025. This Development Fund was applied for and channeled through the Sarawak Marine Fisheries Department. Aquaculture production depends on the quality of the water used for farming. For maximum aquaculture production, water parameters must be at optimal levels. These parameters can vary throughout the day and are also influenced by external environmental conditions. Therefore, continuous monitoring of water parameters is essential to allow for proper analysis and corrective actions to be taken immediately. One of the research components conducted by the Aquaculture Branch, IPPB, is the development of a water quality prediction model based on benthic organisms. The research activities include introducing an Internet of Things (IoT) system in marine fish farming cages. In 2023, the IPP Bintawa Aquaculture Branch introduced an IoT system to monitor water quality in aquaculture cages in the Santubong and Rambungan areas as a pilot study. Through this technology, IoT sensors are installed to monitor physical parameters such as temperature, pH, salinity, and dissolved oxygen levels. In 2023, the IPP Bintawa Aquaculture Branch will use the IoT system to monitor water quality in aquaculture cages in the Santubong and Rambungan areas. Through this technology, a multiparameter probe with IoT sensors can be installed to monitor physical parameters such as temperature, pH, salinity, and oxygen levels in the water of the cage areas. This will help aquaculture farmers monitor water quality in real-time and take necessary actions if there are significant changes in water quality or if it falls outside the optimal range. The multiparameter probe will be monitored periodically to ensure it functions as required. With this design, even aquaculture farmers with less technical experience can interact with the system and understand the information, enabling them to take appropriate actions through engagement sessions with IPPB in collaboration with Satok Bridge Digital Sdn Bhd. As a first step, farmers in the Santubong and Rambungan areas have been selected for the development of the Multiparameter Probe Water Quality System in Cages to facilitate real-time access to water quality data. The use of IoT (Internet of Things) in aquaculture in Malaysia can provide several benefits to aquaculture production. Some examples of IoT use in aquaculture in Malaysia include: 1. Water Quality Monitoring, 2. Precise Feeding, 3. Fish Health Monitoring, 4. Efficient Energy Use, and 5. Remote Monitoring via mobile phones and computers. The use of IoT applications in aquaculture also aligns with the government's aspiration to adopt the Fourth Industrial Revolution (IR4.0) in various key sectors nationwide. By using IoT applications, we hope that aquaculture fishery productivity in Sarawak will improve, thereby helping to increase the income of aquaculture farmers.",
    "appreciation": "Appreciation",
    "appreciationContent": "We thank Mr. Jamil bin Musel, Director of the Fisheries Research Institute, for supervising the research projects held in Sarawak. High appreciation is also given to the Senior Director of the Sarawak Marine Fisheries Department and the Policy Planning and Strategic Branch for coordinating and channeling the Development Fund for the Research Program for the Development of New Methods in Enhancing the Survival and Health of Fish/Shrimp in Aquaculture in Sarawak (P21300060132005) under the Twelfth Malaysia Plan (RMKe12). We also thank the Senior Director of Research at the Batu Maung Fisheries Research Institute, Y.Brs Dr. Azhar bin Hamzah, for his support and guidance in conducting this research program."

}
