{
    "telemetry": "Papan Pemuka",
    "history": "Sejarah",
    "accounting": "Perakaunan",
    "gallery": "Galeri",
    "about": "Tentang",
    "settings": "Tetapan",

    "expenses": "Perbelanjaan",
    "income": "Pendapatan",

    "account": "Akaun",
    "language": "Bahasa",
    "changeLanguage": "Tukar Bahasa",
    "logout": "Log Keluar",

    "camera": "Kamera",
    "camera 1": "Kamera 1",
    "camera 2": "Kamera 2",
    "camera 3": "Kamera 3",
    "camera 4": "Kamera 4",
    "camera 5": "Kamera 5",

    "electric fence": "Pagar Elektrik",
    "electric fence 1": "Pagar Elektrik 1",
    "electric fence 2": "Pagar Elektrik 2",
    "electric fence 3": "Pagar Elektrik 3",
    "electric fence 4": "Pagar Elektrik 4",
    "electric fence 5": "Pagar Elektrik 5",
    "electric fence 6": "Pagar Elektrik 6",
    
    "dateRangePlaceholder": "Sila Pilih Julat Tarikh",
    "deviceLocation": "Lokasi Peranti",
    "deviceID": "ID Peranti",
    "location": "Lokasi",
    "datetime": "Tarikh & Masa",
    "action": "Tindakan",
    "view": "Papar",
    
    "electricFenceAlerts": "Amaran Pagar Elektrik",
    "inTheLast24Hours": "dalam 24 jam yang lalu",
    "alerts": "Amaran",
    "typesOfAlerts": "Jenis-jenis Amaran",
    "electricityShutdown": "Penutupan Elektrik",
    "pushedPulled": "Ditolak / Ditarik",

    "newReport": "Laporan Baharu",
    "addNewReport": "Tambah Laporan Baharu",
    "selectLocation": "Sila Pilih Lokasi",
    "fence": "Pagar",
    "vehicle": "Kenderaan",
    "assets": "Aset",
    "paddock": "",
    "pipe": "Paip",
    "casualties": "Kecederaan",
    "other": "Lain-lain",
    "undamaged": "Tidak Rosak",
    "damaged": "Rosak",
    "images": "Imej",
    "addImagesPlaceholder": "Klik untuk menambah imej",
    "fileTypeUploadValidation": "Jenis Fail: .JPEG, .JPG atau .PNG sahaja.",
    "clickImage": "Klik untuk muat turun imej.",
    "reportingOfficer": "Pegawai Pelapor",
    "reportingOfficerPlaceholder": "Masukkan Pegawai Pelapor",
    "submit": "Hantar",
    "damagedReports": "Laporan Kerosakan",
    "EFDamaged": "Kerosakan Pagar Elektrik",
    "CAMDamaged": "Kerosakan Kamera",
    "date": "Tarikh",
    "officer": "Pegawai",
    "damages": "Kerosakan",
    "weekly": "Mingguan",
    "monthly": "Bulanan",
    "yearly": "Tahunan",
    "typesOfDamages": "Jenis-jenis Kerosakan",

    "user": "Pengguna",
    "generateLinkHeader": "Jana Pautan Pendafataran",
    "linkExp": "Tamat Tempoh Pautan (hari)",
    "admin": "Pentadbir",
    "viewer": "Pemerhati",
    "generateButton": "Jana Pautan",
    "allUsers": "Jenis Pengguna",
    "name": "Nama",
    "userID": "ID",
    "role": "Peranan",
    "status": "Status",
    "userFullname": "Nama Penuh",

    "newDevice": "Peranti Baharu",
    "editDevice": "Edit Peranti",
    "update": "Kemas Kini",
    "deleteConfirmation": "Adakah anda pasti akan memadamkan peranti berikut?",
    "delete": "Padam",
    "cancel": "Batal",
    "addNewDevice": "Tambah Peranti Baharu",
    "deviceType": "Jenis Peranti",
    "deviceName": "Nama Peranti",
    "selectDeviceType": "Sila Pilih Jenis Peranti",
    "installationDate": "Tarikh Pemasangan",
    "selectStatus": "Sila Pilih Status",
    "active": "Aktif",
    "inactive": "Tidak Aktif",
    "deviceLongitude": "Longitud Peranti",
    "deviceLatitude": "Latitud Peranti",
    "longitude": "Longitud",
    "latitude": "Latitud",

    "ippb": "INSTITUT PENYELIDIKAN PERIKANAN BAHAGIAN SARAWAK DAN LABUAN, BINTAWA (IPPB)",
    "background": "Latar Belakang",
    "backgroundContent": "Pada tahun 1965, Kerajaan Persekutuan Malaysia telah menubuhkan Jabatan Perikanan Laut Sarawak (JPLS) untuk membangunkan dan menguruskan perikanan laut serta air payau di Sarawak. Cawangan penyelidikan dalam JPLS ini bertanggungjawab untuk menjalankan penyelidikan yang strategik bagi menyokong pembangunan pengurusan perikanan di Sarawak. Penyelidikan ini menumpu kepada sumber perikanan dan teknologi tangkapan di Sarawak. Pada tahun 1980, penyelidikan ini berkembang ke sektor akuakultur laut dan air payau untuk meningkatkan pembangunan akuakultur di kawasan yang berpotensi di Sarawak. Pada tahun 1995, Cawangan Penyelidikan ini bertukar seliaan dari JPLS ke Institut Penyelidikan Perikanan Malaysia yang berpusat di Pulau Pinang dengan nama barunya Institut Penyelidikan Perikanan Bahagian Sarawak dan Labuan, Bintawa (IPPB).",
    "RMKe12": "Program Penyelidikan Akuakultur di bawah Rancangan Malaysia Keduabelas (RMKe12)",
    "RMKe12Content": "Institut Penyelidikan Perikanan Bahagian Sarawak dan Labuan, Bintawa ataupun lebih dikenali sebagai IPPB, melalui dana Rancangan Malaysia Keduabelas (RMKe12), menjalankan Program PENYELIDIKAN PEMBANGUNAN KAEDAH BARU DALAM PENINGKATAN KEMANDIRIAN DAN KESIHATAN IKAN/UDANG DI DALAM AKUAKULTUR DI SARAWAK (P21300060132005) dari tahun 2021 sehingga 2025. Dana Pembangunan ini telah dipohon dan disalurkan melalui Jabatan Perikanan Laut Sarawak. Pengeluaran akuakultur adalah bergantung kepada kualiti air ternakan tersebut. Untuk pengeluaran akuakultur yang maksimum, parameter air perlu berada pada paras optimum. Parameter ini boleh berubah-ubah dalam tempoh sehari dan perubahan pantas ini juga bergantung kepada keadaan persekitaran luaran. Oleh itu, pemantauan parameter air secara berterusan adalah amat diperlukan supaya analisis dan tindakan pembetulan yang sewajarnya dapat dilakukan dengan segera. Salah satu komponen penyelidikan yang dijalankan oleh Cawangan Akuakultur, IPPB adalah penghasilan model ramalan kualiti air berdasarkan organisma bentik. Aktiviti penyelidikan adalah dengan memperkenalkan sistem Internet of Things (IoT) di sangkar ternakan ikan marin. Pada tahun 2023, Cawangan Akuakultur IPP Bintawa memperkenalkan sistem IoT untuk memantau kualiti air di sangkar ternakan akuakultur di kawasan Santubong dan Rambungan sebagai pilot study. Melalui teknologi ini, Sensor IoT dipasang untuk memantau parameter fizikal seperti suhu, pH, saliniti dan paras oksigen terlarut Pada tahun 2023, Cawangan Akuakultur IPP Bintawa akan menggunakan sistem IOT untuk memantau kualiti air di sangkar ternakan akuakultur di kawasan Santubong dan Rambungan. Melalui teknologi ini, multiparameter probe yang mempunyai sensor IoT dapat dipasang untuk memantau parameter fizikal seperti suhu, pH, saliniti dan paras oksigen air di kawasan ternakan sangkar. Ini akan membantu penternak akuakultur untuk memantau kualiti air secara real-time dan mengambil tindakan yang diperlukan jika ada perubahan air yang signifikan atau berada di luar julat yang optimum. Multiparameter probe tersebut akan dipantau secara berkala bagi memastikan ia akan berjalan seperti yang dikehendaki. Dengan adanya rekaan ini juga, penternak akuakultur yang kurang pengalaman tentang teknikal juga boleh berinteraksi dengan sistem dan dapat memahami maklumat bagi membolehkan tindakan yang sesuai dapat dilaksanakan melalui sesi libat urus dengan pihak IPPB dengan Kerjasama dari Syarikat Satok Bridge Digital Sdn Bhd. Sebagai langkah pertama, pihak penternak di kawasan Santubong dan Rambungan telah dipilih untuk pembangunan sistem multiparameter probe Kualiti Air di Sangkar untuk memudahkan para penternak mendapat akses kepada data kualiti air secara masa sebenar atau real time Penggunaan IoT (Internet of Things) dalam akuakultur di Malaysia dapat memberikan beberapa manfaat terhadap pengeluaran akuakultur. Beberapa contoh penggunaan IoT dalam akuakultur di Malaysia adalah seperti 1. Pemantauan Kualiti Air, 2. Pemberian Makanan yang tepat, 3.Pemantauan Kesihatan Ikan 4. Penggunaan Tenaga yang efisien dan 5. Pemantauan Jarak Jauh menggunakan telefon bimbit dan komputer. Penggunaan aplikasi IoT ini dalam akuakultur juga selaras dengan hasrat kerajaan untuk mengguna Revolusi Perindustrian 4.0 (IR4.0) dalam pelbagai sektor utama di seluruh negara. Dengan menggunakan aplikasi IoT, kita berharap produktiviti perikanan akuakultur di Sarawak akan bertambah baik sekali gus membantu meningkatkan pendapatan penternak akuakultur.",
    "appreciation": "Penghargaan",
    "appreciationContent": "Pihak kami berterima kasih kepada En Jamil bin Musel, Pengarah Institut Penyelidikan Perikanan di atas seliaan projek penyelidikan yang diadakan di Sarawak. Setinggi penghargaan juga diberikan kepada Pengarah Kanan, Jabatan Perikanan Laut Sarawak dan Cawangan Dasar Perancangan dan Strategik di atas penyelarasan dan penyaluran dana pembangunan Program Penyelidikan Pembangunan Kaedah Baru Dalam Peningkatan Kemandirian Dan Kesihatan Ikan/Udang Di Dalam Akuakultur Di Sarawak (P21300060132005) di bawah Rancangan Malaysia Keduabelas (RMKe12). Pihak kami juga berterima kasih kepada Pengarah Kanan Penyelidikan Institut Penyelidikan Perikanan Batu Maung, Y.Brs Dr Azhar bin Hamzah atas sokongan dan bimbingan dalam menjalankan program penyelidikan ini."

}

  
